#+title: Some org extra configs
#+author: Laura Viglioni


*This file is GPL-3.0*


* About
  This file must be initialized with ~org-babel-lob-ingest~. Check [[./l-org-latex-pdf.el][this config file]].

* Org-babel
** Post execution formatters
   Executes these functions using ~:post~ to format the output of codeblocks.
*** Haskell
    #+name: org-babel-haskell-formatter
    #+begin_src emacs-lisp :var strr="" :exports code
      (format "%s" (replace-regexp-in-string
                    (rx line-start
                        (and (* (|  alphanumeric "|" ">" "." "*" blank))
                             (and (* blank) (+ alphanumeric) (| "|" ">"))))
                    "" (format "%s" strr)))
    #+end_src

    #+RESULTS: org-babel-haskell-formatter

**** testing
     #+begin_src emacs-lisp :exports both :post org-babel-haskell-formatter(*this*)
       "Prelude> Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| Prelude> Prelude> 1.0 + 2.0i"
#+end_src

#+RESULTS:
:  1.0 + 2.0i

     #+begin_src emacs-lisp :exports both :post org-babel-haskell-formatter(*this*)
       "Prelude> 1.0 - 2.0i"
#+end_src

#+RESULTS:
:  1.0 - 2.0i

     #+begin_src emacs-lisp :exports both :post org-babel-haskell-formatter(*this*)
       "Prelude| Prelude| Prelude| Prelude| Prelude| Prelude| [1.0 + 0.0i,0.5 + 0.0i,0.5 + 0.5i]"
#+end_src

#+RESULTS:
:  [1.0 + 0.0i,0.5 + 0.0i,0.5 + 0.5i]

     #+begin_src emacs-lisp :exports both :post org-babel-haskell-formatter(*this*)
       "Prelude Data.Monoid> Prelude Data.Monoid| Prelude Data.Monoid| Prelude Data.Monoid| Prelude Data.Monoid| Prelude Data.Monoid| Prelude Data.Monoid| Prelude Data.Monoid> Prelude Data.Monoid> Empty"
#+end_src

#+RESULTS:
:  Empty

     #+begin_src emacs-lisp :exports both :post org-babel-haskell-formatter(*this*)
       "*Sized Data.Monoid> *Sized Data.Monoid| *Sized Data.Monoid| *Sized Data.Monoid| *Sized Data.Monoid| *Sized Data.Monoid| *Sized Data.Monoid> *Sized Data.Monoid> *Sized Data.Monoid> [Single (Size 1) 1]"
#+end_src

#+RESULTS:
:  [Single (Size 1) 1]


*** Clojure
    #+name: org-babel-clojure-formatter
    #+begin_src emacs-lisp :var strr="" :exports code
      (format "%s" (replace-regexp-in-string
                    (rx line-start (+ (| alphanumeric "." blank)) (and ">" (+ blank)))
                    "" (format "%s" strr)))
    #+end_src

    #+RESULTS: org-babel-clojure-formatter

